package com.prothes.newslistapplication;

import androidx.appcompat.app.AlertDialog;
import androidx.appcompat.app.AppCompatActivity;

import android.content.DialogInterface;
import android.content.IntentFilter;
import android.net.ConnectivityManager;
import android.os.Bundle;
import android.widget.ListView;

import java.util.ArrayList;
import java.util.HashMap;

public class HomePage extends AppCompatActivity {
    private ListView listView;
    private HashMap<String,String> hashMap = new HashMap<>();
    private ArrayList< HashMap<String,String> > arrayList;
    private NetworkConnectedCheck networkConnectedCheck = new NetworkConnectedCheck();

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        this.getWindow().setStatusBarColor(getColor(R.color.sky));
        this.getWindow().setNavigationBarColor(getColor(R.color.sky));
        setContentView(R.layout.home_page);

        listView = findViewById(R.id.listView);
        arrayList = new ArrayList<>();

        myTableHashmapDataBase();

        CustomBaseAdapter customBaseAdapter = new CustomBaseAdapter(HomePage.this,arrayList,hashMap);
        listView.setAdapter(customBaseAdapter);


    }
    // ===================================================== User Define Function =================================================================

    public void myTableHashmapDataBase(){

        hashMap = new HashMap<>();
        hashMap.put("catagory","TECH");
        hashMap.put("image_url","https://images.prothomalo.com/prothomalo-bangla%2F2024-09-28%2Fxash87sk%2Fsmartphone.reuters.png?rect=0%2C0%2C640%2C427&auto=format%2Ccompress&fmt=webp&format=webp&w=640&dpr=1.0");
        hashMap.put("title","গুগল প্লে স্টোরের মাধ্যমে ছড়াচ্ছে ম্যালওয়্যার");
        hashMap.put("details","গুগলের নিরাপত্তাব্যবস্থার চোখ এড়িয়ে প্লে স্টোরের মাধ্যমে অ্যান্ড্রয়েড ব্যবহারকারীদের স্মার্টফোনে ছড়িয়ে পড়ছে ‘নেক্রো’ ম্যালওয়্যার। সাইবার নিরাপত্তা প্রতিষ্ঠান ক্যাসপারস্কি জানিয়েছে, প্লে স্টোরে থাকা দুটি অ্যাপে নেক্রো ম্যালওয়্যারের সন্ধান মিলেছে। এসব অ্যাপ এরই মধ্যে ১ কোটি ১০ লাখের বেশিবার ডাউনলোড হয়েছে। অ্যাপের মডিফায়েড সংস্করণের মাধ্যমে ট্রোজান ঘরানার নেক্রো ম্যালওয়্যার ব্যবহারকারীদের স্মার্টফোনে প্রবেশ করানো হয়েছে।" +
                "\n\n"+"ক্যাসপারস্কির তথ্যমতে, ছবি সম্পাদনা ও বিউটিফিকেশন অ্যাপ ‘উইটা ক্যামেরা’ ও ‘ম্যাক্স ব্রাউজার’ অ্যাপে নেক্রো ম্যালওয়্যারের সন্ধান পাওয়া গেছে। উইটা ক্যামেরা অ্যাপটি গুগল প্লে স্টোর থেকে এক কোটির বেশিবার ডাউনলোড হয়েছে। ফলে এক কোটি স্মার্টফোনে ম্যালওয়্যারটি রয়েছে। অপর দিকে ম্যাক্স ব্রাউজারটি ১০ লাখের বেশিবার ডাউনলোড হয়েছে। উইটা ক্যামেরা অ্যাপ থেকে ম্যালওয়্যারটি মুছে ফেলা হলেও ম্যাক্স ব্রাউজারের হালনাগাদ সংস্করণে এখনো রয়েছে ম্যালওয়্যারটি।"
        );
        arrayList.add(hashMap);



        hashMap = new HashMap<>();
        hashMap.put("catagory","SCIENCE");
        hashMap.put("image_url","https://images.prothomalo.com/prothomalo-bangla%2F2024-09-27%2F95okk9a5%2Fplanet.reuters.png?rect=10%2C0%2C540%2C360&auto=format%2Ccompress&fmt=webp&format=webp&w=640&dpr=1.0");
        hashMap.put("title","ভিন্ন ধরনের এক পাথুরে গ্রহের সন্ধান পেয়েছেন জ্যোতির্বিজ্ঞানীরা");
        hashMap.put("details","আমাদের সৌরজগৎ থেকে প্রায় ৪ হাজার ২০০ আলোকবর্ষ দূরে থাকা মিল্কিওয়ে গ্যালাক্সির কেন্দ্রে অবস্থিত ভিন্ন ধরনের এক পাথুরে গ্রহের সন্ধান পেয়েছেন জ্যোতির্বিজ্ঞানীরা। পৃথিবীর তুলনায় প্রায় ১ দশমিক ৯ গুণ বেশি ভরবিশিষ্ট গ্রহটি একটি সাদা বামন নক্ষত্রকে প্রদক্ষিণ করছে। জ্যোতির্বিজ্ঞানীদের ধারণা, এখন থেকে কোটি কোটি বছর পরে পৃথিবী কেমন হতে পারে তার ধারণা দিতে পারে এই গ্রহ।" +
                "\n\n"+"জ্যোতির্বিজ্ঞানীদের তথ্যমতে, সূর্য শেষ সময়ে সর্বোচ্চ আকারে পৌঁছানোর পর পৃথিবীকে পুরোপুরি গ্রাস করে নেবে। এরপরও পৃথিবী টিকে থাকলে মহাশূন্যে ঠান্ডা ও নির্জন পাথুরে গ্রহতে পরিণত হয়ে সাদা বামন নক্ষত্রকে প্রদক্ষিণ করতে থাকবে। আর তাই সূর্যের মৃত্যুর পর পৃথিবী কেমন হবে, সে বিষয়ে তথ্য জানতে নতুন এই গ্রহের বিষয়ে তথ্য সংগ্রহ করা হচ্ছে।" +
                "\n\n"+"জ্যোতির্বিজ্ঞানীদের ধারণা, কেন্দ্রের নক্ষত্রের মৃত্যুর আগে নতুন সন্ধান মেলা পাথুরে গ্রহটি সম্ভবত বাসযোগ্য অঞ্চলে একটি নির্দিষ্টে দূরত্ব থেকে প্রদক্ষিণ করছিল। অর্থাৎ খুব গরম বা খুব ঠান্ডা নয়, এমন এলাকায় অবস্থান করছিল গ্রহটি। এ বিষয়ে যুক্তরাষ্ট্রের ক্যালিফোর্নিয়া বিশ্ববিদ্যালয়ের জ্যোতির্বিজ্ঞানী কেমিং ঝাং বলেন, ‘গ্রহটি বর্তমানে একটি হিমায়িত পৃথিবীর মতো। আমাদের সূর্য ভবিষ্যতে এমনই কোনো এক সাদা বামনে পরিণত হবে।"
        );
        arrayList.add(hashMap);



        hashMap = new HashMap<>();
        hashMap.put("catagory","TECH");
        hashMap.put("image_url","https://ichef.bbci.co.uk/ace/ws/800/cpsprodpb/d2ec/live/b47a7650-338b-11ef-90be-b75b34b0bbb2.jpg.webp");
        hashMap.put("title","জুলিয়ান অ্যাসাঞ্জ কে এবং তিনি কোন গোপন নথি ফাঁস করেছিলেন?");
        hashMap.put("details","মার্কিন কর্তৃপক্ষের সাথে সমঝোতার পর আদালতে দোষ স্বীকার করে দীর্ঘ ১৪ বছর পরে মুক্ত হয়েছেন উইকিলিকসের প্রতিষ্ঠাতা জুলিয়ান অ্যাসাঞ্জ।\n" +
                "\n" +
                "যুক্তরাষ্ট্র সরকারের গোপন সামরিক তথ্য, নথিপত্র প্রকাশ করে ১৪ বছর আগে ব্যাপক আলোচনায় এসেছিলেন মি. অ্যাসাঞ্জ। সেই সময় থেকে তিনি যুক্তরাষ্ট্রের ওয়ান্টেড তালিকায় ছিলেন।\n" +
                "\n" +
                "সুইডেনে একটি ধর্ষণ মামলায় গ্রেফতার এড়াতে সাত বছর ধরে লন্ডনের একুয়েডর দূতাবাসে আশ্রয় নিয়ে লুকিয়ে ছিলেন মি. অ্যাসাঞ্জ। পরে ২০১৯ সালে যুক্তরাজ্যের পুলিশের কাছে গ্রেফতার হওয়ার পর সেদেশের কারাগারে ছিলেন।\n" +
                "\n" +
                "মার্কিন আদালতে দোষ স্বীকার করলে এই কারাবাসকেই তার শাস্তি হিসাবে গণ্য করা হবে, আর কারাভোগ করতে হবে না, মার্কিন সরকারের বিচার বিভাগের সাথে এরকম একটি সমঝোতার পর ব্রিটেন থেকে তিনি মুক্তি পান। তাকে মুক্তি দিতে অনেকদিন ধরে অনুরোধ করে আসছিল মি. অ্যাসাঞ্জের দেশ অস্ট্রেলিয়া।"
        );
        arrayList.add(hashMap);


        hashMap = new HashMap<>();
        hashMap.put("catagory","TECH");
        hashMap.put("image_url","https://ichef.bbci.co.uk/ace/ws/800/cpsprodpb/9d9b/live/51c79050-6d02-11ef-b43e-6916dcba5cbf.jpg.webp");
        hashMap.put("title","যে পাঁচটি পেশার চাহিদা বাড়ছে, সফল হতে যে সব দক্ষতার প্রয়োজন");
        hashMap.put("details","বিশ্বে চাকরির বাজার আগের চেয়ে অনেক দ্রুত বদলে যাচ্ছে এবং এখনকার অনেক চাকরির অস্তিত্ত্ব শিগগিরই অদৃশ্য হয়ে যাবে।\n" +
                "\n" +
                "এই পরিবর্তনের পেছনে প্রধান দুটি কারণের কথা ওয়ার্ল্ড ইকোনমিক ফোরামের সাম্প্রতিক সমীক্ষায় উঠে এসেছে।\n" +
                "\n" +
                "কারণ দুটি হল নতুন প্রযুক্তির উত্থান বা অটোমেশন এবং সবুজ ও টেঁকসই অর্থনীতির দিকে এগিয়ে যাওয়া।\n" +
                "\n" +
                "বিগ ডেটা, ক্লাউড কম্পিউটিং এবং কৃত্রিম বুদ্ধিমত্তার মতো নতুন নতুন প্রযুক্তির দ্রুত অগ্রগতি শ্রমবাজারে আমূল পরিবর্তন আনবে বলে ধারণা করা হচ্ছে।" +
                "ভাল খবর হল, নতুন প্রযুক্তি সার্বিক অর্থনৈতিক উন্নয়নে সাহায্য করবে। এতে একদিকে যেমন অনেক কর্মসংস্থানের খাত তৈরি হবে তেমন অনেক কর্মসংস্থান ধ্বংসও হয়ে যাবে।\n" +
                "\n" +
                "সর্বোপরি, যখন একটি প্রতিষ্ঠান অল্প কর্মসংস্থানে বেশি অর্জন করতে পারে, তখন সেটা স্বাভাবিকভাবেই বেশি প্রসারিত হয়।\n" +
                "\n" +
                "ওয়ার্ল্ড ইকোনমিক ফোরামের গবেষকরা বলছেন, আগামী পাঁচ বছরে বর্তমান চাকরির বাজার প্রায় এক-চতুর্থাংশ বদলে যাবে।\n" +
                "\n" +
                "সুতরাং একটি ক্রমবর্ধমান প্রতিযোগিতামূলক চাকরির বাজারে সফল হতে প্রতিনিয়ত নতুন দক্ষতা শিখে সক্ষমতা বাড়ানোর কোনও বিকল্প নেই।"
        );
        arrayList.add(hashMap);


        hashMap = new HashMap<>();
        hashMap.put("catagory","SCIENCE");
        hashMap.put("image_url","https://ichef.bbci.co.uk/ace/ws/800/cpsprodpb/d1c2/live/d34b2ae0-b913-11ee-82f2-0d6339e13c50.jpg.webp");
        hashMap.put("title","মস্তিষ্কের কর্মক্ষমতা বাড়ানোর আটটি উপায়");
        hashMap.put("details","১. ব্যায়াম\n" +
                "এটা আসলেই সত্যি আমরা শরীর চর্চা বা ব্যায়াম করলে আমাদের মস্তিষ্কের উন্নতি ঘটে।\n" +
                "\n" +
                "ব্যায়ামের কারণে মস্তিষ্কের সাইন্যাপসিস বা যে অংশে দু'টি কোষের নিউরনের মধ্যে স্নায়বিক বৈদ্যুতিক স্পন্দন আদান-প্রদান ঘটে তা বেড়ে যায়। ফলে মস্তিষ্কে আরও বেশি যোগাযোগ স্থাপিত হয় এবং অতিরিক্ত কোষ গঠিত হয়।"+
                "\n২. চলতি পথে মুখস্থ করা\n" +
                "চলতি পথে মুখস্থ করার অভ্যাস বিভিন্ন গবেষণায় প্রমাণিত এবং অভিনেতারা এই বিষয়টির চর্চা করেন।\n" +
                "\n" +
                "বলা হয় যে, আপনি চলার পথে যদি নতুন কোনও শব্দ বা নতুন কিছু শেখার চেষ্টা করেন তাহলে সেটি বেশি মনে থাকে।"+
                "\n৩. সঠিক খাবার খান\n" +
                "আপনি যে পরিমাণ শক্তি ও গ্লুকোজ গ্রহণ করেন তার ২০ শতাংশ সরাসরি আপনার মস্তিষ্কে যায়। এ কারণে আপনার মস্তিষ্কের কার্যক্ষমতা নির্ভর করে দেহের গ্লুকোজের পরিমাণের উপর।\n" +
                "\n" +
                "আপনার দেহের গ্লুকোজের মাত্রা যদি নিয়ন্ত্রণে না থাকে তাহলে আপনার মন ও মস্তিষ্ক অনেকটাই কুয়াশাচ্ছন্ন বা ঝাপসা মনে হতে পারে। আমরা যখন পছন্দের খাবার খাই তখন আমাদের মস্তিষ্কে ডোপামিন নামে এক ধরনের রাসায়নিক নির্গত হয়। এর কারণে আমরা খাওয়ার সময় শান্তি অনুভব করি।"+"" +
                "\n৪. বিরতি নিন\n" +
                "কিছু চাপ বা স্ট্রেস থাকাটা সবসময়ই দরকার কারণ এটি আমাদের জরুরি অবস্থায় দ্রুত প্রতিক্রিয়া দেখাতে সহায়তা করে। এটি কর্টিসল নামে এক ধরনের হরমোনের নিঃসরণকে সহায়তা করে যা সাময়িকভাবে আমাদেরকে উজ্জীবিত করে এবং কোনও কিছুর উপর মনোযোগ দিতে সাহায্য করে।"+
                "\n৫. নতুন চ্যালেঞ্জ নিন\n" +
                "মস্তিষ্কের ক্ষমতা বাড়ানোর একটি ভালো উপায় হচ্ছে একে কোনও একটা চ্যালেঞ্জ দেয়া, যেমন, নতুন কিছু শেখা।"+
                "\n৬. গান শুনুন\n" +
                "সঙ্গীত মস্তিষ্ককে অসাধারণ উপায়ে উদ্দীপিত করে।\n" +
                "\n" +
                "আপনি যদি গান শোনার সময় কিংবা বাদ্য যন্ত্র বাজানোর সময় কারও মস্তিষ্কের চিত্র দেখেন তাহলে দেখবেন যে তার মস্তিষ্কের সব অঙ্গ-প্রত্যঙ্গ সক্রিয় হয়ে উঠেছে।"+
                "\n৭. পড়া এবং ঘুম\n" +
                "আপনি যদি দিনের বেলায় নতুন পড়েন তাহলে, আপনার মস্তিষ্কের স্নায়ুকোষগুলোর মধ্যে এক ধরনের সংযোগ স্থাপিত হয়।" +
                "\n৮. ভালোভাবে জেগে উঠুন\n" +
                "ঘুম যেমন স্বাস্থ্যের জন্য গুরুত্বপূর্ণ তেমনি আপনি কীভাবে ঘুম থেকে জেগে উঠছেন সেটিও গুরুত্বপূর্ণ।\n" +
                "\n" +
                "কিন্তু আপনি দিনের বেলায় কতটা সচেতন ও চাঙ্গা থাকবেন তা নির্ভর করবে আপনি কীভাবে ঘুম থেকে জেগে উঠছেন তার উপর।"
        );
        arrayList.add(hashMap);


        hashMap = new HashMap<>();
        hashMap.put("catagory","FUNNY");
        hashMap.put("image_url","https://ichef.bbci.co.uk/ace/ws/800/cpsprodpb/2DE0/production/_106544711_e4922507-673a-4f2f-b91d-3479994a870b.jpg.webp");
        hashMap.put("title","কঙ্গোর বনরক্ষীদের সাথে সেলফিতে যখন পোজ দিলো গোরিলা");
        hashMap.put("details","গণপ্রজাতন্ত্রী কঙ্গোতে একজন বনরক্ষীর তোলা সেলফিতে দু'টি গোরিলার স্বাভাবিক ভঙ্গিতে দাঁড়িয়ে থাকার বিষয়টি আলোচনা তৈরি করেছে।\n" +
                "\n" +
                "চোরাশিকারীদের হাতে তাদের বাবা-মা মারা যাবার পর গণপ্রজাতন্ত্রী কঙ্গোতে অবস্থিত গোরিলাদের অনাথাশ্রম ভিরুঙ্গা ন্যাশনাল পার্কে ছবির গোরিলাগুলো বেড়ে ওঠে।\n" +
                "\n" +
                "পার্কটির উপ-পরিচালক বিবিসি'কে বলেন, যেই সেবকরা শৈশব থেকে তাদের দেখাশোনা করেছে, গোরিলাগুলো তাদের সেবকদের অনুকরণ করা শিখেছে।\n" +
                "\n" +
                "তিনি বলেন, গোরিলাগুলো মন করে পার্কের ঐ বনরক্ষীরা তাদের অভিভাবক।"
        );
        arrayList.add(hashMap);


        hashMap = new HashMap<>();
        hashMap.put("catagory","CRICKET");
        hashMap.put("image_url","https://ichef.bbci.co.uk/ace/ws/800/cpsprodpb/947f/live/3aa23eb0-610b-11ee-8feb-1f7179b2c49b.jpg.webp");
        hashMap.put("title","ক্রিকেটের ইতিহাসে যে পাঁচটি নতুন পরীক্ষার ল্যাবরেটরি ছিল বিশ্বকাপ");
        hashMap.put("details","১৯৭৫ সালে ইংল্যান্ডে যখন প্রথম ক্রিকেট বিশ্বকাপের আসর বসে, তখন সেই টুর্নামেন্ট আয়োজনের প্রধান বা একমাত্র লক্ষ্য ছিল আইসিসি-র শূন্য কোষাগারে কিছু টাকাপয়সা আমদানি করা।\n" +
                "\n" +
                "আন্তর্জাতিক বিমা সংস্থা প্রুডেন্সিয়াল ওই টুর্নামেন্টে ১ লক্ষ পাউন্ড স্পনসরশিপের অঙ্গীকার করেছিল, সেই ভরসাতেই মাত্র আঠারোটা একদিনের আন্তর্জাতিক ম্যাচ খেলা হওয়ার পরই ওই ফরম্যাটের ‘বিশ্বকাপ’ আয়োজনের সিদ্ধান্ত নিয়ে ফেলে আইসিসি।\n" +
                "\n" +
                "ইংল্যান্ড ততদিনে ডজনখানেক ‘ওয়ানডে’ খেলে ফেললেও ভারত, পাকিস্তান বা ওয়েস্ট ইন্ডিজের মতো টিমগুলো কিন্তু সেই ফরম্যাটে দু’তিনটের বেশি ম্যাচ খেলেনি। অস্ট্রেলিয়া তো মানতেই চায়নি ওয়ানডে ক্রিকেটের আদৌ কোনও ভবিষ্যৎ আছে বলে!\n" +
                "\n" +
                "অথচ এর অনেক পরে টিটোয়েন্টি বা টেস্টের বিশ্বকাপ বা বিশ্ব চ্যাম্পিয়নশিপ চালু হলেও আজও কিন্তু ওয়ানডে বিশ্বকাপের বিজয়ী দলই ক্রিকেট দুনিয়ার অঘোষিত চ্যাম্পিয়নের স্বীকৃতি পেয়ে আসছে।"
        );
        arrayList.add(hashMap);


        hashMap = new HashMap<>();
        hashMap.put("catagory","WAR");
        hashMap.put("image_url","https://ichef.bbci.co.uk/ace/ws/647/cpsprodpb/4bef/live/0862f280-2656-11ef-85ad-a571c985f4a1.jpg.webp");
        hashMap.put("title","ছয়শো বছরের অটোমান সাম্রাজ্যের শুরু ও শেষ যেভাবে");
        hashMap.put("details","জহির-উদ-দীন বাবর ভালো করেই জানতেন যে তার সেনাবাহিনীর সংখ্যা শত্রু বাহিনীর তুলনায় আট ভাগ কম, তাই তিনি এমন একটি পদক্ষেপ নেন, যা ইব্রাহিম লোদি কল্পনাও করতে পারেননি।\n" +
                "\n" +
                "বাবর ছিলেন মধ্য এশিয়ার মুসলিম সম্রাট ও মুঘল সাম্রাজ্যের প্রতিষ্ঠাতা। তিনি পানিপথের প্রথম যুদ্ধে লোদি রাজবংশের শেষ সুলতান ইব্রাহীম লোদিকে পরাজিত করে দিল্লি দখল করে মুঘল সাম্রাজ্য প্রতিষ্ঠা করেছিলেন।\n" +
                "\n" +
                "আর সেই পানিপথের যুদ্ধে অটোমান তুর্কিদের যুদ্ধ কৌশল ব্যবহার করেছিলেন বাবর।"+
                "বলে রাখা ভালো, এটি ছিল পানিপথের প্রথম যুদ্ধ এবং এর আগে ভারতের কোনও যুদ্ধে কামানের ব্যবহার হয়নি। কামানের বিষয়ে অনেকে তখন জানতোই না।\n" +
                "\n" +
                "শুরুর দিকে এই কামানগুলোর লক্ষ্যবস্তুতে আঘাত করার ক্ষমতা খুব একটা ভালো ছিল না।\n" +
                "\n" +
                "তবে বাবর বাহিনী কামান থেকে নির্বিচারে গোলা বর্ষণ শুরু করলে এর আকস্মিক কান-ফাটানো বিস্ফোরণ ও ধোঁয়ায় আফগান বাহিনী বিভ্রান্ত ও ভীত-সন্ত্রস্ত হয়ে পালাতে শুরু করে।\n" +
                "\n" +
                "অথচ ইব্রাহীম লোদির বাহিনীতে ৫০ হাজার সৈন্য ছাড়াও এক হাজারের মতো যুদ্ধ হাতি বা গজবাহিনী ছিল, কিন্তু সৈন্যদের মতো \u200Cএই হাতিগুলোও আগে কখনও কামানের বিস্ফোরণ শোনেনি।\n" +
                "\n" +
                "এ কারণে কামান থেকে গোলা বিস্ফোরণের সাথে সাথে হাতিগুলো যুদ্ধে অংশ নেয়ার পরিবর্তে ছত্রভঙ্গ হয়ে যায়, ধোঁয়ায় সবার শ্বাসরোধ হয়ে আসে।\n" +
                "\n" +
                "অন্যদিকে, বাবরের ১২ হাজার প্রশিক্ষিত অশ্বারোহী বাহিনী অর্থাৎ ঘোড়ার পিঠে চড়ে যুদ্ধ করা যোদ্ধারা এমন মুহূর্তের জন্যই অপেক্ষা করছিল।\n" +
                "\n" +
                "তারা বিদ্যুতের গতিতে এগিয়ে গিয়ে লোদির সেনাবাহিনীকে চারদিক থেকে ঘিরে ফেলে এবং বাবরের বিজয় সুনিশ্চিত হয়ে পড়ে।\n" +
                "\n" +
                "ইতিহাসবিদ পল কে. ডেভিস তার বই ‘হান্ড্রেড ডিসাইসিভ ব্যাটেলস'-বইটিতে এই যুদ্ধকে ইতিহাসের সবচেয়ে ভাগ্য নির্ধারণী যুদ্ধ হিসেবে বর্ণনা করেছেন।\n" +
                "\n" +
                "সেই থেকেই মহান মুঘল সাম্রাজ্যের সূচনা হয়েছিল।"
        );
        arrayList.add(hashMap);


        hashMap = new HashMap<>();
        hashMap.put("catagory","INTERNATIONAL");
        hashMap.put("image_url","https://ichef.bbci.co.uk/ace/ws/800/cpsprodpb/a6ee/live/e43e1cd0-795d-11ef-b02d-c5f3b724a1ea.png.webp");
        hashMap.put("title","‘ট্রাম্পকে হত্যা চেষ্টা সাজানো ছিল’ কেন মনে করছেন মার্কিন ভোটাররা?");
        hashMap.put("details","‘ওয়াইল্ড মাদার’ ছদ্মনামে অনলাইনে শিশুদের সুস্বাস্থ্য ও লালন-পালনের ওপর ভিডিও তৈরি করেন মার্কিন নাগরিক ডেসরি।\n" +
                "\n" +
                "কলোরাডোর পাহাড়ি এলাকায় বসবাস করা এই নারী চান আসন্ন প্রেসিডেন্ট নির্বাচনে রিপাবলিকান প্রার্থী ডোনাল্ড ট্রাম্প জিতুক।\n" +
                "\n" +
                "তবে ডেসরির বাড়ি থেকে ৭০ মাইল উত্তরে ডেনভার সিটিতে বসবাসকারী আরেক নারী ক্যামিলি অবশ্য মি. ট্রাম্পকে মোটেই পছন্দ করেন না।\n" +
                "\n" +
                "গত দেড় দশক ধরে ডেমোক্র্যাটিক পার্টিকে ভোট দিয়ে আসা মিজ ক্যামিলি চান, সামনের নির্বাচনে সাবেক প্রেসিডেন্ট মি. ট্রাম্প হেরে যাক।"+
                "সুতরাং রাজনৈতিক মতাদর্শের দিক থেকে মার্কিন এই দুই নাগরিকের মধ্যে যে বিস্তর ফারাক রয়েছে, সেটি বোঝাই যাচ্ছে।\n" +
                "\n" +
                "কিন্ত মজার ব্যাপার হলো, তারা দু’জনই মনে করেন যে, সম্প্রতি মি. ট্রাম্পকে হত্যার যে চেষ্টা হয়েছে, সেটি আসলে সাজানো ছিল!\n" +
                "\n" +
                "নির্বাচনে জয়লাভ করার কৌশল হিসেবে রিপাবলিকান পার্টির এই প্রার্থী নিজেই ঘটনাটি ঘটিয়েছেন বলেও ধারণা তাদের।\n" +
                "\n" +
                "কিন্তু সম্পূর্ণ বিপরীত মতাদর্শের দু’জনের মধ্যেই একইরকম ধারণা কীভাবে তৈরি হলো?\n" +
                "\n" +
                "উত্তরটা হচ্ছে, সামাজিক যোগাযোগ মাধ্যম।\n" +
                "\n" +
                "তারা দু’জনই বলেছেন যে, মি. ট্রাম্পের বিষয়ে সামাজিক যোগাযোগ মাধ্যমে এমন সব তথ্য পেয়েছেন, যেগুলো দেখে মনে হয়েছে হামলার ঘটনা দু’টি আসলে সাজানো ছিল।\n" +
                "\n" +
                "নির্বাচনের আগে অবশ্য প্রার্থীদের বিষয়ে এমন ‘ষড়যন্ত্র তত্ত্বে’র বিষয়টি মোটেও নতুন কিছু নয়।\n" +
                "\n" +
                "বিশেষ করে, মার্কিন যুক্তরাষ্ট্রের কলোরাডো অঙ্গরাজ্যে নির্বাচনের আগে নানান ধরনের গুজব ও ষড়যন্ত্র তত্ত্ব আগেও ছড়াতে দেখা গেছে।\n" +
                "\n" +
                "ডেসরি ও ক্যামিলির কথার সূত্র ধরে বিবিসি এবারের নির্বাচনকে সামনে রেখে ছড়ানো ‘ষড়যন্ত্র তত্ত্ব’ বিশেষত প্রেসিডেন্ট প্রার্থী ডোনাল্ড ট্রাম্পকে নিয়ে সামাজিক যোগাযোগ মাধ্যম ছড়ানো তথ্যগুলো খতিয়ে দেখেছে।"
        );
        arrayList.add(hashMap);



    }


    // ===================================================== On BackPressed Warning ===============================================================
    @Override
    public void onBackPressed() {
        if (isTaskRoot()){
            AlertDialog alertDialog = new AlertDialog.Builder(HomePage.this)
                    .setTitle("Warning !!")
                    .setMessage("Do you want to exit this app ?")
                    .setPositiveButton("Yes", new DialogInterface.OnClickListener() {
                        @Override
                        public void onClick(DialogInterface dialog, int which) {
                            finish();
                        }
                    })
                    .setNegativeButton("No", new DialogInterface.OnClickListener() {
                        @Override
                        public void onClick(DialogInterface dialog, int which) {
                            dialog.dismiss();
                        }
                    })
                    .setCancelable(true)
                    .show();
            alertDialog.getButton(DialogInterface.BUTTON_POSITIVE).setTextColor(getColor(R.color.sky));
            alertDialog.getButton(DialogInterface.BUTTON_NEGATIVE).setTextColor(getColor(R.color.sky));
        }else {
            super.onBackPressed();
        }
    }


    // ====================================================== Network Check Warning =========================================================
    @Override
    protected void onStart() {
        IntentFilter intentFilter = new IntentFilter(ConnectivityManager.CONNECTIVITY_ACTION);
        registerReceiver(networkConnectedCheck,intentFilter);
        super.onStart();
    }

    @Override
    protected void onStop() {
        unregisterReceiver(networkConnectedCheck);
        super.onStop();
    }

}